{
	"Books":
	[
		{"BookAge":"10-14 years", "BookName":"The Lightning Thief", "BookImage":"https://raw.githubusercontent.com/schi48/JSONProjectsIT315/fd62424b4996e0543d859cf15280589981f1d217/cityofbones.jpeg?token=AVZK42ZDCQI5L3RCBS7MB4TBVKGAQ", "BookAuthor":"Rick Riordan", "BookDescription":"Twelve-year-old Percy Jackson is on the most dangerous quest of his life. With the help of a satyr and a daughter of Athena, Percy must journey across the United States to catch a thief who has stolen the original weapon of mass destruction — Zeus’ master bolt. Along the way, he must face a host of mythological enemies determined to stop him. Most of all, he must come to terms with a father he has never known, and an Oracle that has warned him of betrayal by a friend.", "BookSite":"https://www.amazon.com/Lightning-Thief-Percy-Jackson-Olympians/dp/0786856297/ref=asc_df_0786856297/?tag=hyprod-20&linkCode=df0&hvadid=312281333464&hvpos=&hvnetw=g&hvrand=10535081699359065195&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=2840&hvtargid=pla-311784833276&psc=1", "BookPages": "416 pages", "BookRating": 4.7,"BookPrice":11.89},
		{"BookAge":"14+ years", "BookName":"City of Bones", "BookImage":"https://raw.githubusercontent.com/schi48/JSONProjectsIT315/main/cityofbones.jpeg?token=AVZK424JUH6EIDTMGDKKI2LBVLRKE", "BookDescription":"When her mother disappears, Clary Fray learns that she descends from a line of warriors who protect our world from demons. She joins forces with others like her and heads into a dangerous alternate New York called the Shadow World.", "BookSite":"https://www.amazon.com/City-Bones-Mortal-Instruments-Book-ebook/dp/B0013TXA5Y", "BookPages":"532 pages", "BookRating": 4.5, "BookPrice": 13.99},
		{"BookAge":"8-12 years", "BookName":"Into the Wild", "BookImage":"https://raw.githubusercontent.com/schi48/JSONProjectsIT315/main/intothewild.jpeg?token=AVZK425HSAYKHWGQ46TJ3RDBVLRTK", "BookDescription":"For generations, four Clans of wild cats have shared the forest according to the laws laid down by their ancestors. But the warrior code has been threatened, and the ThunderClan cats are in grave danger. The sinister ShadowClan grows stronger every day. Noble warriors are dying—and some deaths are more mysterious than others. In the midst of this turmoil appears an ordinary housecat named Rusty… who may turn out to be the bravest warrior of them all.", "BookSite":"https://www.amazon.com/Warriors-Into-Wild-Erin-Hunter/dp/0060000023/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=&sr="", "BookPages":"288", "BookRating":4.8, "BookPrice":15.79},
		{"BookAge":"9-12 years", "BookName":"Harry Potter and the Sorcerer's Stone", "BookImage":"https://raw.githubusercontent.com/schi48/JSONProjectsIT315/main/sorcerersstone.jpeg?token=AVZK423FEYKBHPUMGE3DGG3BVLR2A", "BookDescription":"Harry Potter spent ten long years living with Mr. and Mrs. Dursley, an aunt and uncle whose outrageous favoritism of their perfectly awful son Dudley leads to some of the most inspired dark comedy since Charlie and the Chocolate Factory. But fortunately for Harry, he's about to be granted a scholarship to a unique boarding school called THE HOGWORTS SCHOOL OF WITCHCRAFT AND WIZARDRY, where he will become a school hero at the game of Quidditch (a kind of aerial soccer played high above the ground on broomsticks), he will make some wonderful friends, and, unfortunately, a few terrible enemies. For although he seems to be getting your run-of-the-mill boarding school experience (well, ok, even that's pretty darn out of the ordinary), Harry Potter has a destiny that he was born to fulfill. A destiny that others would kill to keep him from.", "BookSite":"https://www.amazon.com/Harry-Potter-Sorcerers-Stone-Rowling/dp/0590353403/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=&sr=", "BookPages":"309 pages", "BookRating":4.9, "BookPrice":13.49},
		{"BookAge":"8-12 years", "BookName":"Powerless (Supers of Noble's Green)", "BookImage":"https://raw.githubusercontent.com/schi48/JSONProjectsIT315/main/powerless.jpeg?token=AVZK42ZJLHLZWHOXQRQTUMTBVLSC6", "BookDescription":"Twelve-year-old Daniel, the new kid in town, soon learns the truth about his nice—but odd—new friends: one can fly, another can turn invisible, yet another controls electricity. Incredible. The superkids use their powers to secretly do good in the town, but they’re haunted by the fact that the moment they turn thirteen, their abilities will disappear—along with any memory that they ever had them. Is a memory-stealing supervillain sapping their powers? The answers lie in a long-ago meteor strike, a World War II–era comic book (Fantastic Futures, starring the first superhero, Johnny Noble), the green-flamed Witch Fire, a hidden Shroud cave, and—possibly, unbelievably—“powerless” regular-kid Daniel himself.", "BookSite":"https://www.amazon.com/Powerless-Supers-Nobles-Green-Matthew/dp/0375844899", "BookPages":"288 pages", "BookRating":4.8, "BookPrice":5.98}
	],
	"Status":"OK"
}